import 'package:week_15_butterflies/buterflies_item.dart';

final butterfliesList = <ButterFliesItem>[
  const ButterFliesItem(
      name: 'Капустница',
      description:
          'Капустница считается довольно крупной бабочкой: размах крыльев взрослой особи может достигать 63 мм. Насекомое имеет округлую голову с голыми глазами и длинными усиками, которые оканчиваются головчатой булавой со светлой вершинкой. На груди – густые волоски белесовато-жёлтого цвета. Шесть ног с острыми коготками помогают капустнице цепко удерживаться на листьях, однако из-за их слабости насекомое почти не умеет ползать',
      image: 'assets/images/kapustnica.jpeg'),
  const ButterFliesItem(
      name: 'Голубянка',
      description:
          ' Небольшая бабочка с размахом крыльев 25-35 мм. У самцов крылья голубые, окаймленные узкой черной полоской, у самок — окрашены в темно-бурый цвет и имеют голубое напыление только у корня крыльев, а края их усеяны оранжевыми пятнами. Нижняя часть крыльев у обоих полов окрашена в серый цвет, по всему фону разбросано множество черных глазчатых пятен. Изредка попадаются самки с голубым налетом на верхней стороне крыльев.',
      image: 'assets/images/golubjanka.jpeg'),
  const ButterFliesItem(
      name: 'Траурница',
      description:
          ' Бабочка Траурница брела такое название за счет своей темной и траурной окраски. Верх крыльев имеет коричнево-вишневый оттенок с белой или желтой окаёмкой. На крыльях есть голубые пятна с черным ободком. Нижняя часть крыльев черно-серая. Они имеют небольшую шерстку по всей поверхности крыльев и тела. Бабочка имеет средние размеры и в размахе крыльев достигает 70-90 сантиметров. Бабочка траурница относится к семейству нимфалид.',
      image: 'assets/images/traurnica.jpeg'),
  const ButterFliesItem(
      name: 'Павлиний глаз',
      description:
          ' Бабочка среднего размера, размах крыльев у самцов 45-55 мм, у самок 50-62 мм. Тельце павлиньего глаза черное, верхняя сторона покрыта рыжеватым пушком, усики булавовидные. Форма крыльев довольно простая, с неглубокими вырезами по краю. Основной цвет верхней стороны крыльев — красный, по переднему краю передних крыльев проходят узкие серо-рябые полоски черные пятна.',
      image: 'assets/images/pavlinii_glaz.jpeg'),
  const ButterFliesItem(
      name: 'Червонец фиолетовый',
      description:
          ' Hекрупная яркая дневная бабочка семейства голубянок. Занесена в Красную книгу Читинской области и Агинского Бурятского автономного округа. Крылья оранжево-красные, со слабым фиолетовым отливом. Передние крылья с широкой темной каймой и рядом пятен между центром и краем.',
      image: 'assets/images/chervonec.jpeg')
];
